# Question number 1:

In [8]:
def BaseConversion(DecNum):
    dec = int(input("Enter a number: "))
    print('Binary: ' + bin(DecNum).replace('0b',""))
    print('Octaly: ' + oct(DecNum).replace('0o',""))
    print('Hexdecimal: ' + hex(DecNum).replace('0x',""))

BaseConversion(dec)

Enter a number: 9415
Binary: 10011100
Octaly: 234
Hexdecimal: 9c

The prefix 0b represents that the result is a binary string. .\
We can say the same to the prefix 0o and 0x (o = oct, x = hexa).

# Question number 2:

In [9]:
import pandas as pd
import numpy as np

cast = pd.read_csv(r'C:\Users\user\Desktop/cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [10]:
cast = cast.drop_duplicates()

### Section 1 - How many movies have the title "Hamlet"?

In [11]:
HamletMovies = cast.loc[cast['title'] == 'Hamlet']
HamletYears = HamletMovies.drop_duplicates(subset = 'year', keep = 'first')
HamletYears.shape

(17, 6)

which means We have got 17 films that released in different years.

### Section 2 - List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
Treasure_Island = cast.loc[cast['title'] == 'Treasure Island']
Treasure_Island.sort_values('year')

,title,year,name,type,character,n
1312766,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3280557,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3046750,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1167783,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

### Section 3 - How many roles were credited in the silent 1921 version of Hamlet?

In [13]:
list = cast.loc[cast['title'] == 'Hamlet']
list = list.loc[cast['year'] == 1921]
list

          title  year                    name     type         character    n
6710     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
408456   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
495468   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1015046  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
1948795  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2116906  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2370048  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2713980  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
2964897  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

### Section 4 - Use groupby() to plot the number of "Hamlet" films made each decade.

In [14]:
Hamlet = cast.loc[cast['title'] == 'Hamlet']
Hamlet.groupby(Hamlet.year//10*10).size()

year
1910    28
1920     9
1940    25
1950     1
1960    57
1970    19
1980     3
1990    84
2000    55
2010    18
dtype: int64

### Section 5 - How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [15]:
cast.loc[cast['year'] >= 1950].loc[cast['year'] < 1960].loc[cast['n'] == 1].groupby(by = ['year', 'type']).count()[['character']]

              character
year type
1950 actor          604
     actress        271
1951 actor          633
     actress        272
1952 actor          591
     actress        284
1953 actor          634
     actress        290
1954 actor          626
     actress        298
1955 actor          606
     actress        264
1956 actor          614
     actress        288
1957 actor          708
     actress        284
1958 actor          694
     actress        275
1959 actor          678
     actress        287

### Section 6 - List the 10 actors/actresses that have the most leading roles (n=1) since the 1990's.

In [20]:
cast[(cast['year']>=1990)&(cast['n']==1)].name.value_counts().head(10)

Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Eric Roberts           68
Amitabh Bachchan       68
Nagarjuna Akkineni     60
Dilip                  59
Name: name, dtype: int64

### Section 7 - List, in order by year, each of the films in which Frank Oz has played more than 1 role

In [21]:
cast[cast.name == 'Frank Oz'].groupby(['title','year']).size() > 1

title                                           year
An American Werewolf in London                  1981     True
Blues Brothers 2000                             1998    False
Innocent Blood                                  1992    False
Inside Out                                      2015    False
Labyrinth                                       1986    False
Monsters, Inc.                                  2001    False
Muppet Treasure Island                          1996     True
Muppets from Space                              1999     True
Sesame Street Presents: Follow that Bird        1985     True
Spies Like Us                                   1985    False
Star Wars: Episode I - The Phantom Menace       1999    False
Star Wars: Episode II - Attack of the Clones    2002    False
Star Wars: Episode III - Revenge of the Sith    2005    False
Star Wars: Episode V - The Empire Strikes Back  1980    False
Star Wars: Episode VI - Return of the Jedi      1983    False
Superman III                                    1983    False
The Adventures of Elmo in Grouchland            1999     True
The Blues Brothers                              1980    False
The Dark Crystal                                1982     True
The Great Muppet Caper                          1981     True
The Muppet Christmas Carol                      1992     True
The Muppet Movie                                1979     True
The Muppets Take Manhattan                      1984     True
Trading Places                                  1983    False
Zathura: A Space Adventure                      2005    False
dtype: bool